# 3. Массив размером 2m + 1, где m — натуральное число, заполнен случайным образом. Найдите в массиве медиану.
# Медианой называется элемент ряда, делящий его на две равные части: в одной находятся элементы, которые не меньше
# медианы, в другой — не больше медианы. Примечание: задачу можно решить без сортировки исходного массива. Но если
# это слишком сложно, используйте метод сортировки, который не рассматривался на уроках (сортировка слиянием также
# недопустима).

from random import randint

m = int(input('Введите m: '))
my_list = [randint(-1000, 1000) for i in range(2*m + 1)]

print(my_list)


def median(array):
    if len(array) == 1:
        return
    array.pop(array.index(min(array)))
    array.pop(array.index(max(array)))
    median(array)


median(my_list)
print('Медиана - ', *my_list)
